#include <dmm.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>

#include "stm32f1xx_hal.h"

#include "calib.h"

#define CALIB_ACCEPTANCE_DEFAULT    0.2

#define SPI_NSS_RLY		GPIO_PIN_11		// SPI2_NSS2 (relay latch)
#define SPI_NSS_DMM		GPIO_PIN_12		// SPI2_NSS1 (DMM HY3131)
#define SPI_SCK			GPIO_PIN_13		// SPI2_SCK
#define SPI_MISO		GPIO_PIN_14		// SPI2_MISO
#define SPI_MOSI		GPIO_PIN_15		// SPI2_MOSI

#define CS_DMM			0
#define CS_RLY			1

// registers from 0x00 to 0x1F
typedef struct _DMMSTS{
    uint8_t ad1[3];		// 0x00
    uint8_t ad2[3];		// 0x03
    uint8_t lpf[3];		// 0x06
    uint8_t rms[5];		// 0x09
    uint8_t pkhmin[3];	// 0x0E
    uint8_t pkhmax[3];	// 0x11
    uint8_t ctsta;		// 0x14
    uint8_t ctc[3];		// 0x15
    uint8_t ctb[3];		// 0x18
    uint8_t cta[3];		// 0x1B
    uint8_t intf;		// 0x1E
    uint8_t inte;		// 0x1F
    uint8_t r[23];		// 0x20
} __attribute__((__packed__)) DMMSTS;

typedef struct _DMMCFG{
    int mode;			// scale
    double range;		// full scale range
    uint8_t sw;			// switch bits
    uint8_t cfg[20];	// configuration bits: 0x20...0x33
    double mul;			// dmm measurement (ad1/rms) multiplication factor to get value in corresponding unit
} DMMCFG;

static const DMMCFG dmmcfg[] = {
// Measure type,	FSR,	sw,		  R20, R21, R22, R23, R24, R25, R26, R27, R28, R29, R2A, R2B, R2C, R2D, R2E, R2F, R30, R31, R32, R33,  scale factor
{ DmmDCVoltage,		5e-2,	0x11,	{0xC2,0x21,0x14,0x8B,0x35,0x11,0x08,0x15,0x31,0xF8,0x00,0x00,0x00,0x00,0x08,0x81,0x80,0xC7,0x3C,0xA8}, 125e-3 / 1.8 / 0x800000 },	// 50 mV DC
{ DmmDCVoltage,		5e-1,	0x11,	{0xC2,0x21,0x14,0x8B,0x85,0x11,0x08,0x15,0x31,0xF8,0x00,0x00,0x00,0x00,0x08,0x81,0x80,0xC7,0x33,0xA8}, 125e-2 / 1.8 / 0x800000 },	// 500 mV DC
